analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32672/Include/max32672.svd
    <register>
     <name>INTFL</name>
     <description>Interrupt Flags Register.</description>
     <addressOffset>0x54</addressOffset>
     <fields>
      <field>
       <name>READY</name>
       <description>ADC is ready.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>ABORT</name>
       <description>Conversion start is aborted.</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>START_DET</name>
       <description>Conversion start is detected.</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>SEQ_STARTED</name>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>SEQ_DONE</name>
       <bitRange>[5:5]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>CONV_DONE</name>
       <bitRange>[6:6]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>CLIPPED</name>
       <bitRange>[7:7]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>FIFO_LVL</name>
       <bitRange>[8:8]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>FIFO_UFL</name>
       <bitRange>[9:9]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>FIFO_OFL</name>
       <bitRange>[10:10]</bitRange>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRADDROFFSET</name>
     <description>SFR Address Offset Register</description>
     <addressOffset>0x60</addressOffset>
     <fields>
      <field>
       <name>OFFSET</name>
       <description>Address Offset for SAR Digital</description>
       <bitRange>[7:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRADDR</name>
     <description>SFR Address Register</description>
     <addressOffset>0x64</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>Address to SAR Digital</description>
       <bitRange>[7:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRWRDATA</name>
     <description>SFR Write Data Register</description>
     <addressOffset>0x68</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>DATA to SAR Digital</description>
       <bitRange>[7:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRRDDATA</name>
     <description>SFR Read Data Register</description>
     <addressOffset>0x6C</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>DATA from SAR Digital</description>
       <bitRange>[7:0]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SFRSTATUS</name>
     <description>SFR Status Register</description>
     <addressOffset>0x70</addressOffset>
     <fields>
      <field>
       <name>NACK</name>
       <description>NACK status for SAR Digital SFR communication</description>
       <bitRange>[0:0]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--ADC Inter-Integrated Circuit.-->
  <peripheral>
   <name>AES</name>
   <description>AES Keys.</description>
   <baseAddress>0x40207400</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CTRL</name>
     <description>AES Control Register</description>
     <addressOffset>0x0000</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>EN</name>
       <description>AES Enable</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>DMA_RX_EN</name>
       <description>DMA Request To Read Data Output FIFO</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>DMA_TX_EN</name>
       <description>DMA Request To Write Data Input FIFO</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>START</name>
       <description>Start AES Calculation</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>INPUT_FLUSH</name>
       <description>Flush the data input FIFO</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OUTPUT_FLUSH</name>
       <description>Flush the data output FIFO</description>
       <bitRange>[5:5]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_SIZE</name>
       <description>Encryption Key Size</description>
       <bitRange>[7:6]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>AES128</name>
         <description>128 Bits.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AES192</name>
         <description>192 Bits.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>AES256</name>
         <description>256 Bits.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TYPE</name>
       <description>Encryption Type Selection</description>
       <bitRange>[9:8]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>STATUS</name>
     <description>AES Status Register</description>
     <addressOffset>0x0004</addressOffset>
     <fields>
      <field>
       <name>BUSY</name>
       <description>AES Busy Status</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>INPUT_EM</name>
       <description>Data input FIFO empty status</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>INPUT_FULL</name>
       <description>Data input FIFO full status</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OUTPUT_EM</name>
       <description>Data output FIFO empty status</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OUTPUT_FULL</name>
       <description>Data output FIFO full status</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTFL</name>
     <description>AES Interrupt Flag Register</description>
     <addressOffset>0x0008</addressOffset>
     <fields>
      <field>
       <name>DONE</name>
       <description>AES Done Interrupt</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_CHANGE</name>
       <description>External AES Key Changed Interrupt</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_ZERO</name>
       <description>External AES Key Zero Interrupt</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OV</name>
       <description>Data Output FIFO Overrun Interrupt</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_ONE</name>
       <description>KEY_ONE</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INTEN</name>
     <description>AES Interrupt Enable Register</description>
     <addressOffset>0x000C</addressOffset>
     <fields>
      <field>
       <name>DONE</name>
       <description>AES Done Interrupt Enable</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_CHANGE</name>
       <description>External AES Key Changed Interrupt Enable</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_ZERO</name>
       <description>External AES Key Zero Interrupt Enable</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>OV</name>
       <description>Data Output FIFO Overrun Interrupt Enable</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
      </field>
      <field>
       <name>KEY_ONE</name>
       <description>KEY_ONE</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO</name>
     <description>AES Data Register</description>
     <addressOffset>0x0010</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>AES FIFO</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
      </field>
     </fields>
    </register>
