analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32672/Include/max32672.svd
     <register>
      <name>SRC</name>
      <description>Source Device Address. If SRCINC=1, the counter bits are incremented by 1,2, or 4, depending on the data width of each AHB cycle. For peripheral transfers, some or all of the actual address bits are fixed. If SRCINC=0, this register remains constant. In the case where a count-to-zero condition occurs while RLDEN=1, the register is reloaded with the contents of DMA_SRC_RLD.</description>
      <addressOffset>0x008</addressOffset>
      <fields>
       <field>
        <name>ADDR</name>
        <bitOffset>0</bitOffset>
        <bitWidth>32</bitWidth>
       </field>
      </fields>
     </register>
     <register>
      <name>DST</name>
      <description>Destination Device Address. For peripheral transfers, some or all of the actual address bits are fixed. If DSTINC=1, this register is incremented on every AHB write out of the DMA FIFO. They are incremented by 1, 2, or 4, depending on the data width of each AHB cycle. In the case where a count-to-zero condition occurs while RLDEN=1, the register is reloaded with DMA_DST_RLD.</description>
      <addressOffset>0x00C</addressOffset>
      <fields>
       <field>
        <name>ADDR</name>
        <bitOffset>0</bitOffset>
        <bitWidth>32</bitWidth>
       </field>
      </fields>
     </register>
     <register>
      <name>CNT</name>
      <description>DMA Counter. The user loads this register with the number of bytes to transfer. This counter decreases on every AHB cycle into the DMA FIFO. The decrement will be 1, 2, or 4 depending on the data width of each AHB cycle. When the counter reaches 0, a count-to-zero condition is triggered.</description>
      <addressOffset>0x010</addressOffset>
      <fields>
       <field>
        <name>CNT</name>
        <description>DMA Counter.</description>
        <bitOffset>0</bitOffset>
        <bitWidth>24</bitWidth>
       </field>
      </fields>
     </register>
     <register>
      <name>SRCRLD</name>
      <description>Source Address Reload Value. The value of this register is loaded into DMA0_SRC upon a count-to-zero condition.</description>
      <addressOffset>0x014</addressOffset>
      <fields>
       <field>
        <name>ADDR</name>
        <description>Source Address Reload Value.</description>
        <bitOffset>0</bitOffset>
        <bitWidth>31</bitWidth>
       </field>
      </fields>
     </register>
     <register>
      <name>DSTRLD</name>
      <description>Destination Address Reload Value. The value of this register is loaded into DMA0_DST upon a count-to-zero condition.</description>
      <addressOffset>0x018</addressOffset>
      <fields>
       <field>
        <name>ADDR</name>
        <description>Destination Address Reload Value.</description>
        <bitOffset>0</bitOffset>
        <bitWidth>31</bitWidth>
       </field>
      </fields>
     </register>
     <register>
      <name>CNTRLD</name>
      <description>DMA Channel Count Reload Register.</description>
      <addressOffset>0x01C</addressOffset>
      <fields>
       <field>
        <name>CNT</name>
        <description>Count Reload Value. The value of this register is loaded into DMA0_CNT upon a count-to-zero condition.</description>
        <bitOffset>0</bitOffset>
        <bitWidth>24</bitWidth>
       </field>
       <field>
        <name>EN</name>
        <description>Reload Enable. This bit should be set after the address reload registers have been programmed. This bit is automatically cleared to 0 when reload occurs.</description>
        <bitOffset>31</bitOffset>
        <bitWidth>1</bitWidth>
        <enumeratedValues>
         <enumeratedValue>
          <name>dis</name>
          <description>Disable.</description>
          <value>0</value>
         </enumeratedValue>
         <enumeratedValue>
          <name>en</name>
          <description>Enable.</description>
          <value>1</value>
         </enumeratedValue>
        </enumeratedValues>
       </field>
      </fields>
     </register>
    </cluster>
   </registers>
  </peripheral>
<!--DMA DMA Controller Fully programmable, chaining capable DMA channels.-->
  <peripheral>
   <name>FCR</name>
   <description>Function Control Register.</description>
   <baseAddress>0x40000800</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>FCTRL0</name>
     <description>Register 0.</description>
     <addressOffset>0x00</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>ERFO_RANGE_SEL</name>
       <description>14MHz-32MHz ERFO Frequency Range Select.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
      <field>
       <name>KEYWIPE_SYS</name>
       <description>KEYWIPE_SYS.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>I2C0_SDA_FILTER_EN</name>
       <description>I2C0 SDA Glitch Filter Enable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Filter disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Filter enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="I2C0_SDA_FILTER_EN">
       <name>I2C0_SCL_FILTER_EN</name>
       <description>I2C0 SCL Glitch Filter Enable.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C0_SDA_FILTER_EN">
       <name>I2C1_SDA_FILTER_EN</name>
       <description>I2C1 SDA Glitch Filter Enable.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C0_SDA_FILTER_EN">
       <name>I2C1_SCL_FILTER_EN</name>
       <description>I2C1 SCL Glitch Filter Enable.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C0_SDA_FILTER_EN">
       <name>I2C2_SDA_FILTER_EN</name>
       <description>I2C2 SDA Glitch Filter Enable.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="I2C0_SDA_FILTER_EN">
       <name>I2C2_SCL_FILTER_EN</name>
       <description>I2C2 SCL Glitch Filter Enable.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCAL0</name>
     <description>Register 1.</description>
     <addressOffset>0x04</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>SEL</name>
       <description>Auto-calibration Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EN</name>
       <description>Autocalibration Run.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LOAD</name>
       <description>Load Trim.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>INVERT</name>
       <description>Invert Gain.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>do Not invert trim step.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>invert</name>
         <description>Invert trim step.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ATOMIC</name>
       <description>Atomic mode.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>GAIN</name>
       <description>MU value.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>12</bitWidth>
      </field>
      <field>
       <name>TRIM</name>
       <description>150MHz HFIO Auto Calibration Trim</description>
       <bitOffset>23</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCAL1</name>
     <description>Register 2.</description>
     <addressOffset>0x08</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>INITIAL</name>
       <description>100MHz IPO Trim Automatic Calibration Initial Trim.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCAL2</name>
     <description>Register 3.</description>
     <addressOffset>0x0C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>RUNTIME</name>
       <description>100MHz IPO Trim Automatic Calibration Run Time.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>DIV</name>
       <description>100MHz IPO Trim Automatic Calibration Divide Factor.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>13</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TS0</name>
     <description>Register 4.</description>
     <addressOffset>0x10</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>GAIN</name>
       <description>Unsigned gain for temp sensor normalization</description>
       <bitOffset>0</bitOffset>
       <bitWidth>12</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TS1</name>
     <description>Register 5.</description>
     <addressOffset>0x14</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>OFFSET</name>
       <description>Signed offset for temp sensor correction</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADCREFTRIM0</name>
     <description>ADC Reference Trim 0</description>
     <addressOffset>0x18</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>VREFP</name>
       <description>Trimming code for VREFP output of reference buffer</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VREFM</name>
       <description>Trimming code for VREFM output of reference buffer</description>
       <bitOffset>8</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VCM</name>
       <description>Trimming code for VCM output of reference buffer</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>VX2_TUNE</name>
       <description>Controls tuning capacitor in fine DAC (offset binary)</description>
       <bitOffset>24</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADCREFTRIM1</name>
     <description>ADC Reference Trim 1</description>
     <addressOffset>0x1C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>VREFP</name>
       <description>Trimming code for VREFP output of reference buffer</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VREFM</name>
       <description>Trimming code for VREFM output of reference buffer</description>
       <bitOffset>8</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VCM</name>
       <description>Trimming code for VCM output of reference buffer</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>VX2_TUNE</name>
       <description>Controls tuning capacitor in fine DAC (offset binary)</description>
       <bitOffset>24</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADCREFTRIM2</name>
     <description>ADC Reference Trim 2</description>
     <addressOffset>0x20</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>IDRV_1P25</name>
       <description>Trimming code for reference buffer drive strength. 1.25V</description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>IBOOST_1P25</name>
       <description>Trimming value for extra drive current in reference buffer outputs. 2.048V</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IDRV_2P048</name>
       <description>Trimming code for reference buffer drive strength. 2.048V</description>
       <bitOffset>8</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>IBOOST_2P048</name>
       <description>Trimming value for extra drive current in reference buffer outputs. 2.048V</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>VCM</name>
       <description>Trimming code for VCM output of reference buffer</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>VX2_TUNE</name>
       <description>Controls tuning capacitor in fine DAC (offset binary)</description>
       <bitOffset>24</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ERFOKS</name>
     <description>External Radio Frequency Oscillator Kick Start Control Register.</description>
     <addressOffset>0x24</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>CTRL</name>
       <description>Kickstart Control for ERFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
