analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32672/Include/max32672.svd
   </registers>
  </peripheral>
<!--I2S Inter-IC Sound Interface.-->
  <peripheral>
   <name>ICC0</name>
   <description>Instruction Cache Controller Registers</description>
   <baseAddress>0x4002A000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x800</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>INFO</name>
     <description>Cache ID Register.</description>
     <addressOffset>0x0000</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>RELNUM</name>
       <description>Release Number. Identifies the RTL release version.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>PARTNUM</name>
       <description>Part Number. This field reflects the value of C_ID_PART_NUMBER configuration parameter.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>ID</name>
       <description>Cache ID. This field reflects the value of the C_ID_CACHEID configuration parameter.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SZ</name>
     <description>Memory Configuration Register.</description>
     <addressOffset>0x0004</addressOffset>
     <access>read-only</access>
     <resetValue>0x00080008</resetValue>
     <fields>
      <field>
       <name>CCH</name>
       <description>Cache Size. Indicates total size in Kbytes of cache.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
      <field>
       <name>MEM</name>
       <description>Main Memory Size. Indicates the total size, in units of 128 Kbytes, of code memory accessible to the cache controller.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL</name>
     <description>Cache Control and Status Register.</description>
     <addressOffset>0x0100</addressOffset>
     <fields>
      <field>
       <name>EN</name>
       <description>Cache Enable. Controls whether the cache is bypassed or is in use. Changing the state of this bit will cause the instruction cache to be flushed and its contents invalidated.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Cache Bypassed. Instruction data is stored in the line fill buffer but is not written to main cache memory array.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Cache Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RDY</name>
       <description>Cache Ready flag. Cleared by hardware when at any time the cache as a whole is invalidated (including a system reset). When this bit is 0, the cache is effectively in bypass mode (instruction fetches will come from main memory or from the line fill buffer). Set by hardware when the invalidate operation is complete and the cache is ready.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>notReady</name>
         <description>Not Ready.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ready</name>
         <description>Ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INVALIDATE</name>
     <description>Invalidate All Registers.</description>
     <addressOffset>0x0700</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>INVALID</name>
       <description>Invalidate.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--ICC0 Instruction Cache Controller Registers-->
  <peripheral>
   <name>MCR</name>
   <description>Misc Control.</description>
   <baseAddress>0x40106C00</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>RST</name>
     <description>Low Power Reset Control Register</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>LPTMR0</name>
       <description>Low Power Timer0 Reset.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <name>reset</name>
        <usage>read-write</usage>
        <enumeratedValue>
         <name>reset_done</name>
         <description>Reset complete.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>busy</name>
         <description>Starts Reset or indicates reset in progress.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="LPTMR0">
       <name>LPTMR1</name>
       <description>Low Power Timer1 Reset.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="LPTMR0">
       <name>LPUART0</name>
       <description>Low Power UART0 Reset.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="LPTMR0">
       <name>RTC</name>
       <description>RTC Reset.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CLKCTRL</name>
     <description>Clock Control.</description>
     <addressOffset>0x08</addressOffset>
     <fields>
      <field>
       <name>ERTCO_PD</name>
       <description>32KHz Crystal Oscillator Power Down.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERTCO_EN</name>
       <description>32KHz Crystal Oscillator Enable.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Is Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Is Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>AINCOMP</name>
     <description>AIN Comparator.</description>
     <addressOffset>0x0C</addressOffset>
     <fields>
      <field>
       <name>PD</name>
       <description>AIN Comparator Power Down control.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>HYST</name>
       <description>AIN Comparator Hysteresis control.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>NSEL_COMP0</name>
       <description>Negative input select for AIN Comparator 0.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>PSEL_COMP0</name>
       <description>Positive input select for AIN Comparator 0</description>
       <bitOffset>20</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>NSEL_COMP1</name>
       <description>Negative input select for AIN Comparator 1</description>
       <bitOffset>24</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>PSEL_COMP1</name>
       <description>Positive input select for AIN Comparator 1</description>
       <bitOffset>28</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LPPIOCTRL</name>
     <description>Low Power Peripheral IO Control Register.</description>
     <addressOffset>0x10</addressOffset>
     <fields>
      <field>
       <name>LPTMR0_I</name>
       <description>Enable control for LPTMR0 input.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LPTMR0_O</name>
       <description>Enable control for LPTMR0 output.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LPTMR1_I</name>
       <description>Enable control for LPTMR1 input.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LPTMR1_O</name>
       <description>Enable control for LPTMR1 output.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LPUART0_RX</name>
       <description>Enable control for LPUART0 RX.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LPUART0_TX</name>
       <description>Enable control for LPUART0 TX.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LPUART0_CTS</name>
       <description>Enable control for LPUART0 CTS.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LPUART0_RTS</name>
       <description>Enable control for LPUART0 RTS.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PCLKDIS</name>
     <description>Low Power Peripheral Clock Disable.</description>
     <addressOffset>0x24</addressOffset>
     <fields>
      <field>
       <name>LPTMR0</name>
       <description>Low Power Timer0 Clock Disable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>enable it.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>disable it.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="LPTMR0">
       <name>LPTMR1</name>
       <description>Low Power Timer1 Clock Disable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="LPTMR0">
       <name>LPUART0</name>
       <description>Low Power UART0 Clock Disable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AESKEY</name>
     <description>AES Key Pointer and Status.</description>
     <addressOffset>0x34</addressOffset>
     <fields>
      <field>
       <name>PTR</name>
       <description>AESKEY Pointer and Status.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADC_CFG0</name>
     <description>ADC Cfig Register0.</description>
     <addressOffset>0x38</addressOffset>
     <fields>
      <field>
       <name>LP_5K_DIS</name>
       <description>Disable 5K divider option in low power modes</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LP_50K_DIS</name>
       <description>Disable 50K divider option in low power modes</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>EN</name>
         <description>Enable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIS</name>
         <description>Disable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>EXT_REF</name>
       <description>External Reference</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>REF_SEL</name>
       <description>Reference Select</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADC_CFG1</name>
     <description>ADC Config Register1.</description>
     <addressOffset>0x3C</addressOffset>
     <fields>
      <field>
       <name>CH0_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH0</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>divider select always used.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>divider select only used when channel is selected.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH1_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH1</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH2_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH2</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH3_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH3</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH4_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH4</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH5_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH5</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH6_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH6</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH7_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH7</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH8_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH8</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH9_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH9</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH10_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH10</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH11_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH11</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CH0_PU_DYN">
       <name>CH12_PU_DYN</name>
       <description>ADC PU Dynamic Control for CH12</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADC_CFG2</name>
     <description>ADC Config Register2.</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>CH0</name>
       <description>Divider Select for channel 0</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>div1</name>
         <description>Pass through, no divider.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div2_5k</name>
         <description>Divide by 2, 5Kohm.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div2_50k</name>
         <description>Divide by 2, 50Kohm.</description>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="CH0">
       <name>CH1</name>
       <description>Divider Select for channel 1</description>
       <bitOffset>2</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH2</name>
       <description>Divider Select for channel 2</description>
       <bitOffset>4</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH3</name>
       <description>Divider Select for channel 3</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH4</name>
       <description>Divider Select for channel 4</description>
       <bitOffset>8</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH5</name>
       <description>Divider Select for channel 5</description>
       <bitOffset>10</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH6</name>
       <description>Divider Select for channel 6</description>
       <bitOffset>12</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH7</name>
       <description>Divider Select for channel 7</description>
       <bitOffset>14</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH8</name>
       <description>Divider Select for channel 8</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH9</name>
       <description>Divider Select for channel 9</description>
       <bitOffset>18</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH10</name>
       <description>Divider Select for channel 10</description>
       <bitOffset>20</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH11</name>
       <description>Divider Select for channel 11</description>
       <bitOffset>22</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field derivedFrom="CH0">
       <name>CH12</name>
       <description>Divider Select for channel 12</description>
       <bitOffset>24</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADC_CFG3</name>
     <description>ADC Config Register3.</description>
     <addressOffset>0x44</addressOffset>
     <fields>
      <field>
       <name>VREFM</name>
       <description>VREFM</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VREFP</name>
       <description>VREFP</description>
       <bitOffset>8</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>IDRV</name>
       <description>IDRV</description>
       <bitOffset>16</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>VCM</name>
       <description>VCM</description>
       <bitOffset>20</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>ATB</name>
       <description>ATB</description>
       <bitOffset>22</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>D_IBOOST</name>
       <description>D_IBOOST</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
