analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32672/Include/max32672.svd
    <register derivedFrom="LPWKST0">
     <name>LPWKST1</name>
     <description>Low Power I/O Wakeup Status Register 1. This register indicates the low power wakeup status for GPIO1.</description>
     <addressOffset>0x0C</addressOffset>
    </register>
    <register derivedFrom="LPWKEN0">
     <name>LPWKEN1</name>
     <description>Low Power I/O Wakeup Enable Register 1. This register enables low power wakeup functionality for GPIO1.</description>
     <addressOffset>0x10</addressOffset>
    </register>
    <register>
     <name>LPPWKST</name>
     <description>Low Power Peripheral Wakeup Status Register.</description>
     <addressOffset>0x30</addressOffset>
     <fields>
      <field>
       <name>LPTMR0</name>
       <description>LPTM0 Wakeup Flag.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>LPTMR1</name>
       <description>LPTMR1 Wakeup Flag.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>LPUART0</name>
       <description>LPUART0 Wakeup Flag.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>AINCOMP0</name>
       <description>AINCOMP0 Wakeup Flag.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>AINCOMP1</name>
       <description>AINCOMP1 Wakeup Flag.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>AINCOMP0_OUT</name>
       <description>AINCOMP0 Status.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>AINCOMP1_OUT</name>
       <description>AINCOMP1 Status.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>BACKUP</name>
       <description>BBMODE Wakeup Flag.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
     </fields>
    </register>
    <register>
     <name>LPPWKEN</name>
     <description>Low Power Peripheral Wakeup Enable Register.</description>
     <addressOffset>0x34</addressOffset>
     <fields>
      <field>
       <name>LPTMR0</name>
       <description> TIMER4 Wakeup Enable. This bit allows wakeup from the TIMER4.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>LPTMR1</name>
       <description> TIMER5 Wakeup Enable. This bit allows wakeup from the TIMER5.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>LPUART0</name>
       <description> LPUART Wakeup Enable. This bit allows wakeup from the LPUART.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>AINCOMP0</name>
       <description> AINCOMP0 Wakeup Enable. This bit allows wakeup from the AINCOMP0.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>AINCOMP1</name>
       <description> AINCOMP1 Wakeup Enable. This bit allows wakeup from the AINCOMP1.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>LPMEMSD</name>
     <description>Low Power Memory Shutdown Control.</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>RAM0</name>
       <description>System RAM block 0 Shut Down.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RAM1</name>
       <description>System RAM block 1 Shut Down.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RAM2</name>
       <description>System RAM block 2 Shut Down.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RAM3</name>
       <description>System RAM block 3 Shut Down.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>normal</name>
         <description>Normal Operating Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>shutdown</name>
         <description>Shutdown Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>GPR0</name>
     <description>General Purpose Register 0.</description>
     <addressOffset>0x48</addressOffset>
    </register>
    <register>
     <name>GPR1</name>
     <description>General Purpose Register 1.</description>
     <addressOffset>0x4C</addressOffset>
    </register>
