analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32672/Include/max32672.svd
   </registers>
  </peripheral>
<!--PWRSEQ Power Sequencer / Low Power Control Register.-->
  <peripheral>
   <name>QDEC</name>
   <description>Quadrature Encoder Interface</description>
   <baseAddress>0x40063000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CTRL</name>
     <description>Control Register.</description>
     <addressOffset>0x0000</addressOffset>
     <fields>
      <field>
       <name>en</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <name>enum</name>
        <enumeratedValue>
         <name>disable</name>
         <value>0x0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>enable</name>
         <value>0x1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>mode</name>
       <bitOffset>1</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <name>enum</name>
        <enumeratedValue>
         <name>x1mode</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>x2mode</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>x4mode</name>
         <value>2</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>swap</name>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>filter</name>
       <bitOffset>4</bitOffset>
       <bitWidth>2</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <name>enum</name>
        <enumeratedValue>
         <name>1_sample</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>2_samples</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>3_samples</name>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>4_samples</name>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>rst_index</name>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>rst_maxcnt</name>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>sticky</name>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>psc</name>
       <bitOffset>16</bitOffset>
       <bitWidth>3</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <name>enum</name>
        <enumeratedValue>
         <name>div1</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div2</name>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div4</name>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div8</name>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div16</name>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div32</name>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div64</name>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>div128</name>
         <value>7</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INTFL</name>
     <description>Interrupt Flag Register.</description>
     <addressOffset>0x0004</addressOffset>
     <fields>
      <field>
       <name>index</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>qerr</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>compare</name>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>maxcnt</name>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>capture</name>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>dir</name>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
      <field>
       <name>move</name>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <modifiedWriteValues>oneToClear</modifiedWriteValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INTEN</name>
     <description>Interrupt Enable Register.</description>
     <addressOffset>0x0008</addressOffset>
     <fields>
      <field>
       <name>index</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>qerr</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>compare</name>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>maxcnt</name>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>capture</name>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>dir</name>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>move</name>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>MAXCNT</name>
     <description>Maximum Count Register.</description>
     <addressOffset>0x000C</addressOffset>
     <fields>
      <field>
       <name>maxcnt</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INITIAL</name>
     <description>Initial Count Register.</description>
     <addressOffset>0x0010</addressOffset>
     <fields>
      <field>
       <name>initial</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>COMPARE</name>
     <description>Compare Register.</description>
     <addressOffset>0x0014</addressOffset>
     <fields>
      <field>
       <name>compare</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INDEX</name>
     <description>Index Register. count captured when QEI fired</description>
     <addressOffset>0x0018</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>index</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CAPTURE</name>
     <description>Capture Register. counter captured when QES fired</description>
     <addressOffset>0x001C</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>capture</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>STATUS</name>
     <description>Status Register.</description>
     <addressOffset>0x0020</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>dir</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>POSITION</name>
     <description>Count Register. raw counter value</description>
     <addressOffset>0x0024</addressOffset>
     <fields>
      <field>
       <name>position</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CAPDLY</name>
     <description>delay CAPTURE</description>
     <addressOffset>0x0028</addressOffset>
     <fields>
      <field>
       <name>capdly</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
